"""
Пакет, для аэродинамических расчётов, реализованный студентами
ФАЛТ МФТИ, включающий в себя:
1. базовые аэродинамические функции
2. функции для работы с аэродинамическими профилями
3. python обёртку расчётчика xfoil 

Реализованные возможности пакета:
1. aerodynamics:
    flow.py:
    1) Re - вычисление числа Рейнольдса
    2) M - вычисление числа Маха
    3) speed_of_sound - вычисление скорости звука
    aero_coefficients.py:
    1) Y_from_Cl - подъёмная сила по коэффициенту подъёмной силы
    2) Cl_from_Y - коэффициент подъёмной силы по подъёмной силе
    3) Cl_required - потребный коэффициент подъёмной силы для горизонтального полёта
    4) X_from_Cd - сила лобового сопротивления по коэффициенту сопротивления
    5) Cd_from_X - коэффициент лобового сопротивления по силе сопротивления
    6) Cd_induced - коэффициент индуктивного сопротивления по теории несущей линии
    7) aerodynamic_efficiency - аэродинамическое качество K = Cl / Cd
    ...
2. airfoils
    ...
3. xfoilpy
    ...

"""

from . import aerodynamics
from . import airfoils
from . import xfoilpy
